In [1]:
import pandas as pd

as in: http://scrapingauthority.com/pandas-dataframe-filtering/

In [2]:
data = {
    'name': ['Jack', 'Frank', 'Kelly', 'Rebecca', 'Monica'],
    'year': [2015, 2011, 2010, 2014, None],
    'reports': [24, 4, 2, 31, None]
}

In [3]:
df = pd.DataFrame(
    data,
    index = ['New York', 'New Orleans', 'Budapest', 'Helsinki', 'Cologne']
)

In [4]:
df

                name    year  reports
New York        Jack  2015.0     24.0
New Orleans    Frank  2011.0      4.0
Budapest       Kelly  2010.0      2.0
Helsinki     Rebecca  2014.0     31.0
Cologne       Monica     NaN      NaN

Filtering using the ```query``` method:

In [32]:
alt_query = df[(df['year'] > 2012) | (df['name'] == 'Frank')]

In [33]:
alt_query

                name    year  reports
New York        Jack  2015.0     24.0
New Orleans    Frank  2011.0      4.0
Helsinki     Rebecca  2014.0     31.0

In [5]:
df.query('year > 2012 | name == "Frank"')

                name    year  reports
New York        Jack  2015.0     24.0
New Orleans    Frank  2011.0      4.0
Helsinki     Rebecca  2014.0     31.0

In [34]:
loc_query = df.loc[(df.year > 2012) | (df.name == 'Frank')]

In [35]:
loc_query

                name    year  reports
New York        Jack  2015.0     24.0
New Orleans    Frank  2011.0      4.0
Helsinki     Rebecca  2014.0     31.0

In [15]:
myList_isin = [4, 2]

In [18]:
df[df['reports'].isin(myList_isin)]

              name    year  reports
New Orleans  Frank  2011.0      4.0
Budapest     Kelly  2010.0      2.0

show nulls:

In [21]:
df[df['year'].isnull()]

           name  year  reports
Cologne  Monica   NaN      NaN

In [22]:
df

                name    year  reports
New York        Jack  2015.0     24.0
New Orleans    Frank  2011.0      4.0
Budapest       Kelly  2010.0      2.0
Helsinki     Rebecca  2014.0     31.0
Cologne       Monica     NaN      NaN

In [23]:
df[df['reports'].isnull()]

           name  year  reports
Cologne  Monica   NaN      NaN

In [24]:
df[df['name'].isnull()]

Empty DataFrame
Columns: [name, year, reports]
Index: []

showing not nulls

In [25]:
df[df['reports'].notnull()]

                name    year  reports
New York        Jack  2015.0     24.0
New Orleans    Frank  2011.0      4.0
Budapest       Kelly  2010.0      2.0
Helsinki     Rebecca  2014.0     31.0

In [26]:
df[df['name'].notnull()]

                name    year  reports
New York        Jack  2015.0     24.0
New Orleans    Frank  2011.0      4.0
Budapest       Kelly  2010.0      2.0
Helsinki     Rebecca  2014.0     31.0
Cologne       Monica     NaN      NaN

In [27]:
df[df['year'].notnull()]

                name    year  reports
New York        Jack  2015.0     24.0
New Orleans    Frank  2011.0      4.0
Budapest       Kelly  2010.0      2.0
Helsinki     Rebecca  2014.0     31.0

In [36]:
cellular = {
    'country': ['Bulgaria', 'Denmark', 'Romania', 'Russia', 'United Kingdom'],
    'year': [2011, 2011, 2011, 2011, 2011],
    'celluar_subscriptions': [10475083, 7047000, 23400000, 256116581, 81612000]
}

In [37]:
cellular_data = pd.DataFrame(cellular)

In [38]:
cellular_data

          country  year  celluar_subscriptions
0        Bulgaria  2011               10475083
1         Denmark  2011                7047000
2         Romania  2011               23400000
3          Russia  2011              256116581
4  United Kingdom  2011               81612000

In [ ]:
cellular_data.index = ['BG', '']